Ran Plan for 5 projects:

1. project: `SPA-adot-production` dir: `SPA/SPA-adot/env/production` workspace: `default`
1. project: `SPA-adot-staging` dir: `SPA/SPA-adot/env/staging` workspace: `default`
1. project: `application-adot-helia` dir: `applications/application-adot/env/helia` workspace: `default`
1. project: `application-adot-production` dir: `applications/application-adot/env/production` workspace: `default`
1. project: `application-adot-staging` dir: `applications/application-adot/env/staging` workspace: `default`
---

### 1. project: `SPA-adot-production` dir: `SPA/SPA-adot/env/production` workspace: `default`
<details><summary>Show Output</summary>

```diff
Assuming role: arn:aws:iam::569023477847:role/atlantis-cross-account-role-prod for production environment
Successfully assumed role for production
Using credentials: ASIAYI7DRHBL2ZLQMBU5
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- my_bucket in modules/s3
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.34.0...
- Installed hashicorp/aws v6.34.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.my_bucket.aws_s3_bucket.this will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "network-prod-bucket71113"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "us-east-1"
+       request_payer               = (known after apply)
+       tags                        = {
+           "Environment" = "production"
        }
+       tags_all                    = {
+           "Environment" = "production"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[0] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block                                = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-1"
        }
+       tags_all                                       = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[1] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block                                = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-2"
        }
+       tags_all                                       = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       region                               = "us-east-1"
+       tags                                 = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-vpc"
        }
+       tags_all                             = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-vpc"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/33/default/SPA/SPA-adot/env/production/SPA-adot-production-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/33/default/SPA/SPA-adot/env/production/SPA-adot-production-default.tfplan"
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 2. project: `SPA-adot-staging` dir: `SPA/SPA-adot/env/staging` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'echo "Assuming role: arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage for staging environment"

# Assume role and save output to temp file
aws sts assume-role \
  --role-arn "arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage" \
  --role-session-name "atlantis-SPA-adot-staging-workflow" \
  --duration-seconds 3600 \
  --query 'Credentials.[AccessKeyId,SecretAccessKey,SessionToken]' \
  --output text > /tmp/assume-role-output-$$.txt

# Read credentials from temp file
read AWS_ACCESS_KEY_ID AWS_SECRET_ACCESS_KEY AWS_SESSION_TOKEN < /tmp/assume-role-output-$$.txt
rm -f /tmp/assume-role-output-$$.txt

if [ -n "$AWS_ACCESS_KEY_ID" ]; then
  export AWS_ACCESS_KEY_ID
  export AWS_SECRET_ACCESS_KEY
  export AWS_SESSION_TOKEN
  echo "Successfully assumed role for staging"
  echo "Using credentials: $AWS_ACCESS_KEY_ID"
else
  echo "Failed to assume role for staging"
  exit 1
fi

cd "$(dirname "$PROJECT_DIR")/../.."
rm -rf .terraform .terraform.lock.hcl

terraform init -backend-config="env/staging/stage.conf" -reconfigure -lock=false -input=false

terraform plan -compact-warnings -var-file="config/stage.tfvars" -lock-timeout=10m -out=$PLANFILE
' in '/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/33/default/SPA/SPA-adot/env/staging': exit status 1: running "echo \"Assuming role: arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage for staging environment\"\n\n# Assume role and save output to temp file\naws sts assume-role \\\n  --role-arn \"arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage\" \\\n  --role-session-name \"atlantis-SPA-adot-staging-workflow\" \\\n  --duration-seconds 3600 \\\n  --query 'Credentials.[AccessKeyId,SecretAccessKey,SessionToken]' \\\n  --output text > /tmp/assume-role-output-$$.txt\n\n# Read credentials from temp file\nread AWS_ACCESS_KEY_ID AWS_SECRET_ACCESS_KEY AWS_SESSION_TOKEN < /tmp/assume-role-output-$$.txt\nrm -f /tmp/assume-role-output-$$.txt\n\nif [ -n \"$AWS_ACCESS_KEY_ID\" ]; then\n  export AWS_ACCESS_KEY_ID\n  export AWS_SECRET_ACCESS_KEY\n  export AWS_SESSION_TOKEN\n  echo \"Successfully assumed role for staging\"\n  echo \"Using credentials: $AWS_ACCESS_KEY_ID\"\nelse\n  echo \"Failed to assume role for staging\"\n  exit 1\nfi\n\ncd \"$(dirname \"$PROJECT_DIR\")/../..\"\nrm -rf .terraform .terraform.lock.hcl\n\nterraform init -backend-config=\"env/staging/stage.conf\" -reconfigure -lock=false -input=false\n\nterraform plan -compact-warnings -var-file=\"config/stage.tfvars\" -lock-timeout=10m -out=$PLANFILE\n" in "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/33/default/SPA/SPA-adot/env/staging": 
Assuming role: arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage for staging environment
Successfully assumed role for staging
Using credentials: ASIAYI7DRHBLSWDZEEEQ
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
╷
│ Error: Error refreshing state: Unable to access object "application1/network/staging/terraform1.tfstate" in S3 bucket "tf-state-prod517": operation error S3: HeadObject, https response error StatusCode: 403, RequestID: R0VDGSY36Q65VNPS, HostID: 46unK3BVjpRnB+P+ASHYx7ZmksaiqGk7fmCisbveLjuN6ZV+sHt7UYYOoAtzSHjX0ML5SWjqUG8=, api error Forbidden: Forbidden
│ 
│ 
╵
╷
│ Error: error loading state: Unable to access object "application1/network/staging/terraform1.tfstate" in S3 bucket "tf-state-prod517": operation error S3: HeadObject, https response error StatusCode: 403, RequestID: R0VEX4V98BJXSPD3, HostID: xnZDiIsi/87RH/bNDVeaxZRB03V0+lbKe33PsCATuyqbdJdRddA0UJYYyL0Sv7OxYSQxEEBU4KTCkKdO+yf19s278wK++vHFWrMhgLJazTs=, api error Forbidden: Forbidden
│ 
│ 
╵


```
</details>

---
### 3. project: `application-adot-helia` dir: `applications/application-adot/env/helia` workspace: `default`
<details><summary>Show Output</summary>

```diff
Using existing AWS credentials for helia environment
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- my_bucket in modules/s3
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.34.0...
- Installed hashicorp/aws v6.34.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.my_bucket.aws_s3_bucket.this will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "network-prod-bucket71113"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "us-east-1"
+       request_payer               = (known after apply)
+       tags                        = {
+           "Environment" = "helia"
        }
+       tags_all                    = {
+           "Environment" = "helia"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[0] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block                                = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "helia"
+           "Name"        = "prod-atlantis-private-1"
        }
+       tags_all                                       = {
+           "Environment" = "helia"
+           "Name"        = "prod-atlantis-private-1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[1] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block                                = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "helia"
+           "Name"        = "prod-atlantis-private-2"
        }
+       tags_all                                       = {
+           "Environment" = "helia"
+           "Name"        = "prod-atlantis-private-2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       region                               = "us-east-1"
+       tags                                 = {
+           "Environment" = "helia"
+           "Name"        = "prod-atlantis-vpc"
        }
+       tags_all                             = {
+           "Environment" = "helia"
+           "Name"        = "prod-atlantis-vpc"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/33/default/applications/application-adot/env/helia/application-adot-helia-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/33/default/applications/application-adot/env/helia/application-adot-helia-default.tfplan"
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 4. project: `application-adot-production` dir: `applications/application-adot/env/production` workspace: `default`
<details><summary>Show Output</summary>

```diff
Assuming role: arn:aws:iam::569023477847:role/atlantis-cross-account-role-prod for production environment
Successfully assumed role for production
Using credentials: ASIAYI7DRHBLURIDVBKL
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- my_bucket in modules/s3
- vpc in modules/vpc
Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.34.0...
- Installed hashicorp/aws v6.34.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.my_bucket.aws_s3_bucket.this will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "network-prod-bucket71113"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_region               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = "us-east-1"
+       request_payer               = (known after apply)
+       tags                        = {
+           "Environment" = "production"
        }
+       tags_all                    = {
+           "Environment" = "production"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[0] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block                                = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-1"
        }
+       tags_all                                       = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-1"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private_subnets[1] will be created
+   resource "aws_subnet" "private_subnets" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block                                = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "us-east-1"
+       tags                                           = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-2"
        }
+       tags_all                                       = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-private-2"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       region                               = "us-east-1"
+       tags                                 = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-vpc"
        }
+       tags_all                             = {
+           "Environment" = "production"
+           "Name"        = "prod-atlantis-vpc"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/33/default/applications/application-adot/env/production/application-adot-production-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/33/default/applications/application-adot/env/production/application-adot-production-default.tfplan"
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 5. project: `application-adot-staging` dir: `applications/application-adot/env/staging` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'echo "Assuming role: arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage for staging environment"

# Assume role and save output to temp file
aws sts assume-role \
  --role-arn "arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage" \
  --role-session-name "atlantis-application-adot-staging-workflow" \
  --duration-seconds 3600 \
  --query 'Credentials.[AccessKeyId,SecretAccessKey,SessionToken]' \
  --output text > /tmp/assume-role-output-$$.txt

# Read credentials from temp file
read AWS_ACCESS_KEY_ID AWS_SECRET_ACCESS_KEY AWS_SESSION_TOKEN < /tmp/assume-role-output-$$.txt
rm -f /tmp/assume-role-output-$$.txt

if [ -n "$AWS_ACCESS_KEY_ID" ]; then
  export AWS_ACCESS_KEY_ID
  export AWS_SECRET_ACCESS_KEY
  export AWS_SESSION_TOKEN
  echo "Successfully assumed role for staging"
  echo "Using credentials: $AWS_ACCESS_KEY_ID"
else
  echo "Failed to assume role for staging"
  exit 1
fi

cd "$(dirname "$PROJECT_DIR")/../.."
rm -rf .terraform .terraform.lock.hcl

terraform init -backend-config="env/staging/stage.conf" -reconfigure -lock=false -input=false

terraform plan -compact-warnings -var-file="config/stage.tfvars" -lock-timeout=10m -out=$PLANFILE
' in '/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/33/default/applications/application-adot/env/staging': exit status 1: running "echo \"Assuming role: arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage for staging environment\"\n\n# Assume role and save output to temp file\naws sts assume-role \\\n  --role-arn \"arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage\" \\\n  --role-session-name \"atlantis-application-adot-staging-workflow\" \\\n  --duration-seconds 3600 \\\n  --query 'Credentials.[AccessKeyId,SecretAccessKey,SessionToken]' \\\n  --output text > /tmp/assume-role-output-$$.txt\n\n# Read credentials from temp file\nread AWS_ACCESS_KEY_ID AWS_SECRET_ACCESS_KEY AWS_SESSION_TOKEN < /tmp/assume-role-output-$$.txt\nrm -f /tmp/assume-role-output-$$.txt\n\nif [ -n \"$AWS_ACCESS_KEY_ID\" ]; then\n  export AWS_ACCESS_KEY_ID\n  export AWS_SECRET_ACCESS_KEY\n  export AWS_SESSION_TOKEN\n  echo \"Successfully assumed role for staging\"\n  echo \"Using credentials: $AWS_ACCESS_KEY_ID\"\nelse\n  echo \"Failed to assume role for staging\"\n  exit 1\nfi\n\ncd \"$(dirname \"$PROJECT_DIR\")/../..\"\nrm -rf .terraform .terraform.lock.hcl\n\nterraform init -backend-config=\"env/staging/stage.conf\" -reconfigure -lock=false -input=false\n\nterraform plan -compact-warnings -var-file=\"config/stage.tfvars\" -lock-timeout=10m -out=$PLANFILE\n" in "/home/atlantis/.atlantis/repos/RameezAhmedZaka/ECS-Atlantis/33/default/applications/application-adot/env/staging": 
Assuming role: arn:aws:iam::569023477847:role/atlantis-cross-account-role-stage for staging environment
Successfully assumed role for staging
Using credentials: ASIAYI7DRHBLS27BCS3U
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
╷
│ Error: Error refreshing state: Unable to access object "application1/network/staging/terraform1.tfstate" in S3 bucket "tf-state-prod517": operation error S3: HeadObject, https response error StatusCode: 403, RequestID: 86YB2WVRN4SQ3C5P, HostID: 1umn+iM5IPzU91Jc7M6GZOlGnVrjPPcSK/0uSaeENpD5i8jDT5CpX0BlvrVRo6664EYvagT1NpQ=, api error Forbidden: Forbidden
│ 
│ 
╵
╷
│ Error: error loading state: Unable to access object "application1/network/staging/terraform1.tfstate" in S3 bucket "tf-state-prod517": operation error S3: HeadObject, https response error StatusCode: 403, RequestID: 86Y87ZBXZWPM91CW, HostID: oI/pgjUmTOX9m2cJ6akaD1Dpt+RAMaoqni/i31c4ev4hK1cZO7Yr+59bgdeIjw48G66SctsihnM=, api error Forbidden: Forbidden
│ 
│ 
╵


```
</details>

---
### Plan Summary

5 projects, 3 with changes, 0 with no changes, 2 failed